{
    "subject": "[Lab 06] Q2: WWPD: Using the Car class",
    "content": "<p><a href=\"https://cs61a.org/lab/lab06/#q2\" target=\"_blank\" rel=\"noopener noreferrer\">Q2: Using the Car class</a><br /><br /></p>\n<p>Please post all questions you have below concerning Q2: Using the Car class in the follow-ups.<br /><br /></p>\n<p>If you are stuck on this question, feel free to read through the follow-up responses to see if you can draw any ideas from them.</p>",
    "threads": [
        {
            "question": "Unlocking Question:  >>> from car import *   >>> deneros_car = MonsterTruck('Monster', 'Batmobile')   >>> deneros_car.drive() # Type Error if an error occurs and Nothing if nothing is displayed  I know what it should be, and I've tried all the possible answers. Could anyone let me know if they pass this case?",
            "follow-ups": [
                {
                    "feedback": "I was able to pass this case. Hint: make sure you understand the WWPD difference between a printed string and returned string"
                },
                {
                    "feedback": "Thanks!"
                },
                {
                    "feedback": "So aren't I suppose to return the thing in the print statement? I've been tryping the samething that was under the class Monster Truck (function rev) but Im not passing the case... I need help."
                },
                {
                    "feedback": "nvm i figured it out"
                }
            ]
        },
        {
            "question": "![](/redirect/s3?bucket=uploads&prefix=attach%2Fjziyku5gomy7aq%2Fjzt20qlrozj7mg%2Fk1gxxwvbbhfu%2F%E5%BE%AE%E4%BF%A1%E6%88%AA%E5%9B%BE_20191007144148.png)Why this will return Error? Is there any theories? I just using my feeling.....",
            "follow-ups": [
                {
                    "feedback": "![](/redirect/s3?bucket=uploads&prefix=attach%2Fjziyku5gomy7aq%2Fjzt20qlrozj7mg%2Fk1gy0kglz9w8%2F%E5%BE%AE%E4%BF%A1%E6%88%AA%E5%9B%BE_20191007144354.png)Besides, how to evaluate this expression?"
                },
                {
                    "feedback": "Make sure you understand the \"Methods and functions\" section [here](http://composingprograms.com/pages/25-object-oriented- programming.html#message-passing-and-dot-expressions)"
                },
                {
                    "feedback": "I got the same problem on Car.drive(deneros_car). Shouldn’t it invoke error because as Car is passed as the first argument for drive, but deneros_car is also an argument for drive. I’m so confused."
                }
            ]
        },
        {
            "question": "return self.make + ' ' + self.model + ' goes vroom!'  How do we deal with strings and the plus sign?",
            "follow-ups": [
                {
                    "feedback": "They are all returned inside one ‘ ‘."
                }
            ]
        },
        {
            "question": "For the first test under MonsterTruck, why wouldn’t the first line return ‘Vroom! This Monster Truck is huge!’ ?",
            "follow-ups": [
                {
                    "feedback": "No quotes. The print statement doesnt print the quotes."
                }
            ]
        },
        {
            "question": "why deneros_car.gas is not equals Car.gas?  >>> deneros_car.gas   ? 20   \\-- OK! --  >>> Car.gas   ? 20   \\-- Not quite. Try again! --  ? 30   \\-- OK! --",
            "follow-ups": [
                {
                    "feedback": "deneros_car is an object of the Cars class and was defined with its own gas, wheels, make, model, etc. The Car object has its own defined variables that objects can inherit, but in this case the first few assignments sets the gas of Car to be 30."
                }
            ]
        },
        {
            "question": "![](/redirect/s3?bucket=uploads&prefix=attach%2Fjziyku5gomy7aq%2Fjkaea2a0ntf6ft%2Fk1mdlaa2o692%2FScreen_Shot_20191011_at_9.58.35_AM.png)  So I understand and got line one but I don't get what line two is supposed to be here .. I feel like I've tried all possible options",
            "follow-ups": [
                {
                    "feedback": "Notice that MonsterTruck.drive() is the function below:                     def drive(self):              self.rev()              return Car.drive(self)  The first line is generated by the call to rev() so that means the second line is generated by Car.drive(self). Self in this case referes to deneros_car since it is passed in as the parameter. We know Car.drive() returns a string, so the string you get back from this will be the second line of output."
                }
            ]
        },
        {
            "question": ">>> from car import *  >>> deneros_car = MonsterTruck('Monster', 'Batmobile')  >>> deneros_car.drive() # Type Error if an error occurs and Nothing if nothing is displayed  Im confused on this case,,, I feel like I have tried everything,,, shouldn't the car drive? and not have the printed statement bc its a normal drive ?",
            "follow-ups": [
                {
                    "feedback": "nvm I can't spell :/"
                },
                {
                    "feedback": "Just stuck in the same problem. Could you explain it?"
                }
            ]
        },
        {
            "question": "What would be the output for >>> deneros_car.fill_gas() I thought the output would be Gas level : 30"
        }
    ]
}