{
    "subject": "Sign up for CS370 Tutoring for Week 11!",
    "content": "<p dir=\"ltr\">Signups for Week 11 of tutoring through CS 370 are open (from 11/4 - 11/10)! </p>\n<p> </p>\n<p dir=\"ltr\">The tutors are here to help you with concepts, to go through examples with you, and to help you learn how to solve problems that you get stuck on. That means you should NOT ask them for homework or project help. Please go to office hours for that.</p>\n<p> </p>\n<p dir=\"ltr\">Please be sure that you intend to attend your appointment if you choose to sign up. Do note that failing to show up for an appointment can negatively impact your chances of receiving an appointment in the future. Additionally, note that although 370 makes their best attempt to match everyone with a section, it may be the case that the demand is too high and it is impossible to match everyone. As the semester goes on, demand tends to decrease, so definitely sign up even if you weren&#39;t able to be matched in the past!</p>\n<p> </p>\n<p dir=\"ltr\">Here’s the sign-up form for tutoring next week: <a href=\"https://forms.gle/kVQoRxwwEHWJ8HBi6\">https://forms.gle/kVQoRxwwEHWJ8HBi6</a> </p>\n<p dir=\"ltr\">And here’s the feedback form: <a href=\"http://bit.ly/370f19\">bit.ly/370f19</a></p>\n<p> </p>\n<p dir=\"ltr\">Please take note of a few things, if you choose to sign up for tutoring:</p>\n<p dir=\"ltr\">1. Be specific about what you want help with, and list several times during which you’re available. This is to increase your chances of getting a tutoring appointment.</p>\n<p dir=\"ltr\">2. Monitor your email carefully. If a tutor contacts you, and you do not reply to their offer within 24 hours, your appointment may be cancelled at the tutor’s discretion.</p>\n<p dir=\"ltr\">3. On your calendar, mark the time slots you said you’d be available on the sign-up form. If you miss an appointment or schedule something on top of it, you will get lower tutoring priority in the future.</p>\n<p dir=\"ltr\">4. You must fill out the feedback form after your tutoring appointment. If you don’t, then you will get lower tutoring priority in the future.</p>\n<p dir=\"ltr\">5. Good luck &amp; have fun!!</p>\n<p></p>",
    "threads": [
        {
            "question": "I signed up yesterday, by when would I receive an email?",
            "follow-ups": [
                {
                    "feedback": "Tutors typically reach out to students late Sunday - early Tuesday, although there is not exact time or guarantee"
                }
            ]
        }
    ]
}